#+TITLE: Labwork Remote Sensing
#+SUBTITLE: How to use and to extract information from remote sensing images for land management ?
#+DATE: \today
#+AUTHOR: Mathieu Fauvel
#+EMAIL: mathieu.fauvel@ensat.fr
#+LANGUAGE: en
#+SELECT_TAGS: sigma
#+EXCLUDE_TAGS: noexport
#+TODO: TODO INPROGRESS DONE | CANCEL 
#+OPTIONS:   H:3 num:t toc:2 \n:nil ::t |:t ^:nil -:t f:t *:t <:t prop:nil todo:nil tags:nil

#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS: [a4paper,11pt,DIV=18]
#+LATEX_HEADER:\usepackage[english]{babel}\usepackage{minted}\usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA:\usepackage{tikz}\usepackage{pgfplots}\usepgfplotslibrary{dateplot}\usetikzlibrary{shapes,arrows}\usepackage[]{tcolorbox}
#+LATEX_HEADER_EXTRA: \newtcolorbox[auto counter,number within=section]{work}[1][]{colback=black!5!white,colframe=black!50!white,fonttitle=\sffamily\bfseries,title=Work~\thetcbcounter: #1}

#+COLUMNS: %25ITEM %FORMATION %DURATION %SEQUENCE %TAG

*** Remote Sensing - Advanced                                       :sigma:
#+ATTR_LATEX: :booktabs t
#+CAPTION: Sequences
| Sequences                    | Type   |   Volume | Topics                                                |
|------------------------------+--------+----------+-------------------------------------------------------|
| [2017-10-02 Mon 10:00-12:00] | CTD    | 02:00:00 | Introduction to Scipy: array manipulation             |
| [2017-10-09 Mon 13:30-17:30] | CTD    | 04:00:00 | Template filters  1/2                                 |
| [2017-10-11 Wed 13:30-15:30] | CTD    | 02:00:00 | Template filters 2/2 + GDAL manipulation 1/2          |
| [2017-10-16 Mon 13:30-17:30] | CTD    | 04:00:00 | GDAL manipulation 2/2 + Historical Maps 1/2           |
| [2017-10-18 Wed 13:30-15:30] | Projet | 02:00:00 | Historical Maps 2/2                                   |
| [2017-10-23 Mon 13:30-17:30] | CTD    | 04:00:00 | Linking Qgis to Python - Your first processing plugin |
| [2017-11-09 Thu 08:00-10:00] | EXAM   | 02:00:00 | EXAM Groupe 1 & 2                                     |
|------------------------------+--------+----------+-------------------------------------------------------|
| Total                        |        | 20:00:00 |                                                       |
#+TBLFM: @>$3=vsum(@I$3..@II$3)*1;T
   
*** String
Handling  strings with  python is  very easy.  It is  possible to  add
strings together, as with number! Pay attention to spaces...

#+BEGIN_SRC python
name="Mathieu"
surname="Fauvel"
print name + surname
#+END_SRC

#+RESULTS:
: MathieuFauvel

To use numbers in strings, it is necessary to convert them, using the function =str=

#+BEGIN_SRC python
print "Bonjour j\'ai eu " + str(33) + " ans"
#+END_SRC

#+RESULTS:
: Bonjour j'ai eu 33 ans

*** +Test speed+

#+BEGIN_SRC python :results output
import myfilters as mf
import time
import scipy as sp

# Load image
image = sp.load("/home/mfauvel/Documents/Enseignement/ENSAT/Master SIGMA/Documents/TP/python/ikonos_part.npy")

# 
tic = time.time()
im1 = mf.filterMax(image,p=1)
print "Processing time : {}".format(time.time()-tic)

tic = time.time()
im1 = mf.filterMaxS(image,p=1)
print "Processing time : {}".format(time.time()-tic)
#+END_SRC

#+RESULTS:
: Processing time : 0.954054117203
: Processing time : 0.926885128021

